pkg/wsman/wsmantesting/responses/ips/optin/get.xml

<?xml version= "1.0" encoding= "UTF-8"?>
<a:Envelope xmlns:a= "http://www.w3.org/2003/05/soap-envelope" xmlns:b= "http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:c= "http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:d= "http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:e= "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:f= "http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:g= "http://intel.com/wbem/wscim/1/ips-schema/1/IPS_OptInService" xmlns:h= "http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi= "http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>1</b:RelatesTo>
        <b:Action a:mustUnderstand= "true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000300</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/ips-schema/1/IPS_OptInService</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:IPS_OptInService>
            <g:CanModifyOptInPolicy>1</g:CanModifyOptInPolicy>
            <g:CreationClassName>IPS_OptInService</g:CreationClassName>
            <g:ElementName>Intel(r) AMT OptIn Service</g:ElementName>
            <g:Name>Intel(r) AMT OptIn Service</g:Name>
            <g:OptInCodeTimeout>120</g:OptInCodeTimeout>
            <g:OptInDisplayTime out>300
            </g:OptInDisplayTimeout>
            <g:OptInRequired>0</g:OptInRequired>
            <g:OptInState>0</g:OptInState>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>Intel(r) AMT</g:SystemName>
        </g:IPS_OptInService>
    </a:Body>
</a:Envelope>